let  firstquest = prompt('Оберіть столицю України. Вірна відповідь оцінюється в два бали. \n Київ; \n Одеса; \n Львів.', 'Впишіть назву міста');

let points = 0;

if (firstquest == "Київ") {
    points = points + 2;
}

let secondquest = prompt('Оберіть столицю Туреччини. Вірна відповідь оцінюється в два бали. \n Стамбул; \n Анкара; \n Ізмір.','Впишіть назву міста');

if (secondquest == "Анкара") {
    points = points + 2;
}

let lastquest = prompt('Оберіть столицю Канади. Вірна відповідь оцінюється в два бали. \n Торонто; \n Оттава;\n Едмонтон.','Впишіть назву міста');

if (lastquest == "Оттава") {
    points = points + 2;
}

alert(`Ви набрали  ${points} балів`);








