let userNum = prompt("Введіть число від 0 до 9");

switch (userNum) {
    case '0' : {
        alert('На клавіатурі цьому числу відповідає спецсимвол - ).');
        break;
    }

    case '1': {
        alert('На клавіатурі цьому числу відповідає спецсимвол - !.')
        break;
    }

    case '2' : {
        alert('На клавіатурі цьому числу відповідає спецсимвол - @.');
        break;
    }

    case '3' : {
        alert('На клавіатурі цьому числу відповідає спецсимвол - #.');
        break;
    }

    case '4' : {
        alert('На клавіатурі цьому числу відповідає спецсимвол - $.');
        break;
    }

    case '5' : {
        alert('На клавіатурі цьому числу відповідає спецсимвол - %.');
        break;
    }

    case '6' : {
        alert('На клавіатурі цьому числу відповідає спецсимвол - ^.');
        break;
    }

    case '7' : {
        alert('На клавіатурі цьому числу відповідає спецсимвол - &.');
        break;
    }

    case '8' : {
        alert('На клавіатурі цьому числу відповідає спецсимвол - *.');
        break;
    }

    case '9' : {
        alert('На клавіатурі цьому числу відповідає спецсимвол - (.');
        break;
    }
    default :
    alert("Ви ввели невірне число. Повторіть спробу і введіть число від 0 до 9.")
}